data/read_write_split_enable_8_with_read_pct_80/test-mysql-run-80-20-75-time-2023-08-23-11-10.txt
run sysbench
check mysql database exists
mysql host 172.16.134.200 connect success!
database mydb exists
/usr/bin/sysbench
cd ./sysbench/src/lua;sysbench --db-driver=mysql --mysql-host=172.16.134.200 --mysql-port=3306 --mysql-user=root --mysql-password=sf2gxx9r --mysql-db=mydb --table_size=2000000 --tables=50 --time=60 --threads=75 --events=0 --percentile=99 --read-percent=80 --write-percent=20 --skip_trx=on --mysql-ignore-errors=1062 --db-ps-mode=disable --report-interval=1 oltp_read_write_pct run
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 75
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 75 tps: 106.86 qps: 16076.54 (r/w/o: 13281.27/2795.27/0.00) lat (ms,99%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 75 tps: 118.06 qps: 12912.84 (r/w/o: 10706.67/2206.17/0.00) lat (ms,99%): 733.00 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 75 tps: 148.00 qps: 13413.03 (r/w/o: 10757.03/2656.01/0.00) lat (ms,99%): 877.61 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 75 tps: 126.00 qps: 13395.00 (r/w/o: 10497.00/2898.00/0.00) lat (ms,99%): 694.45 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 75 tps: 132.00 qps: 13362.99 (r/w/o: 10746.99/2616.00/0.00) lat (ms,99%): 694.45 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 75 tps: 142.00 qps: 13524.03 (r/w/o: 10863.02/2661.01/0.00) lat (ms,99%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 75 tps: 140.00 qps: 13897.95 (r/w/o: 11029.96/2867.99/0.00) lat (ms,99%): 682.06 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 75 tps: 129.00 qps: 12585.04 (r/w/o: 9963.03/2622.01/0.00) lat (ms,99%): 694.45 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 75 tps: 101.00 qps: 10857.95 (r/w/o: 8896.96/1960.99/0.00) lat (ms,99%): 846.57 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 75 tps: 113.00 qps: 11767.09 (r/w/o: 9166.07/2601.02/0.00) lat (ms,99%): 846.57 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 75 tps: 126.00 qps: 11511.91 (r/w/o: 9375.92/2135.98/0.00) lat (ms,99%): 831.46 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 75 tps: 106.00 qps: 12162.13 (r/w/o: 9676.10/2486.03/0.00) lat (ms,99%): 759.88 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 75 tps: 138.00 qps: 12221.94 (r/w/o: 9867.95/2353.99/0.00) lat (ms,99%): 773.68 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 75 tps: 115.00 qps: 12634.92 (r/w/o: 9913.94/2720.98/0.00) lat (ms,99%): 719.92 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 75 tps: 139.00 qps: 11974.12 (r/w/o: 9814.10/2160.02/0.00) lat (ms,99%): 746.32 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 75 tps: 87.00 qps: 10608.99 (r/w/o: 8605.00/2004.00/0.00) lat (ms,99%): 877.61 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 75 tps: 129.00 qps: 11243.97 (r/w/o: 8619.98/2623.99/0.00) lat (ms,99%): 816.63 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 75 tps: 97.00 qps: 11359.01 (r/w/o: 9647.00/1712.00/0.00) lat (ms,99%): 787.74 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 75 tps: 95.00 qps: 10026.99 (r/w/o: 7391.99/2635.00/0.00) lat (ms,99%): 926.33 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 75 tps: 146.00 qps: 11947.01 (r/w/o: 9883.01/2064.00/0.00) lat (ms,99%): 802.05 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 75 tps: 107.00 qps: 12580.03 (r/w/o: 9686.02/2894.01/0.00) lat (ms,99%): 694.45 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 75 tps: 134.00 qps: 12526.74 (r/w/o: 10531.78/1994.96/0.00) lat (ms,99%): 877.61 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 75 tps: 117.00 qps: 12242.23 (r/w/o: 9406.18/2836.05/0.00) lat (ms,99%): 719.92 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 75 tps: 135.00 qps: 13006.98 (r/w/o: 10702.98/2304.00/0.00) lat (ms,99%): 846.57 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 75 tps: 96.00 qps: 10537.03 (r/w/o: 8228.03/2309.01/0.00) lat (ms,99%): 846.57 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 75 tps: 126.00 qps: 10905.94 (r/w/o: 8681.95/2223.99/0.00) lat (ms,99%): 846.57 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 75 tps: 105.00 qps: 12227.93 (r/w/o: 10071.94/2155.99/0.00) lat (ms,99%): 831.46 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 75 tps: 120.00 qps: 10992.10 (r/w/o: 8415.07/2577.02/0.00) lat (ms,99%): 802.05 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 75 tps: 111.00 qps: 11408.02 (r/w/o: 9387.02/2021.00/0.00) lat (ms,99%): 846.57 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 75 tps: 104.00 qps: 11029.01 (r/w/o: 8736.00/2293.00/0.00) lat (ms,99%): 816.63 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 75 tps: 110.94 qps: 10877.41 (r/w/o: 8761.49/2115.91/0.00) lat (ms,99%): 861.95 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 75 tps: 117.06 qps: 11220.79 (r/w/o: 8814.54/2406.24/0.00) lat (ms,99%): 816.63 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 75 tps: 112.00 qps: 10993.99 (r/w/o: 9039.99/1954.00/0.00) lat (ms,99%): 816.63 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 75 tps: 103.00 qps: 10972.01 (r/w/o: 8579.01/2393.00/0.00) lat (ms,99%): 893.56 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 75 tps: 118.00 qps: 11517.96 (r/w/o: 9267.96/2249.99/0.00) lat (ms,99%): 846.57 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 75 tps: 131.00 qps: 12666.00 (r/w/o: 10078.00/2588.00/0.00) lat (ms,99%): 733.00 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 75 tps: 125.00 qps: 12773.99 (r/w/o: 10430.99/2343.00/0.00) lat (ms,99%): 733.00 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 75 tps: 98.00 qps: 10674.06 (r/w/o: 8333.05/2341.01/0.00) lat (ms,99%): 877.61 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 75 tps: 137.00 qps: 11965.82 (r/w/o: 9670.85/2294.96/0.00) lat (ms,99%): 733.00 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 75 tps: 103.00 qps: 12194.16 (r/w/o: 9613.12/2581.03/0.00) lat (ms,99%): 694.45 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 75 tps: 127.00 qps: 10413.00 (r/w/o: 8310.00/2103.00/0.00) lat (ms,99%): 893.56 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 75 tps: 97.00 qps: 11629.92 (r/w/o: 9723.93/1905.99/0.00) lat (ms,99%): 802.05 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 75 tps: 96.00 qps: 9963.06 (r/w/o: 7542.05/2421.01/0.00) lat (ms,99%): 909.80 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 75 tps: 125.00 qps: 10273.01 (r/w/o: 8236.00/2037.00/0.00) lat (ms,99%): 893.56 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 75 tps: 97.00 qps: 11133.03 (r/w/o: 9210.02/1923.01/0.00) lat (ms,99%): 877.61 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 75 tps: 97.00 qps: 10302.97 (r/w/o: 8025.98/2276.99/0.00) lat (ms,99%): 831.46 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 75 tps: 115.00 qps: 10941.95 (r/w/o: 8762.96/2178.99/0.00) lat (ms,99%): 926.33 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 75 tps: 113.00 qps: 10854.09 (r/w/o: 8765.07/2089.02/0.00) lat (ms,99%): 877.61 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 75 tps: 103.00 qps: 10707.94 (r/w/o: 8398.95/2308.99/0.00) lat (ms,99%): 831.46 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 75 tps: 113.00 qps: 10501.03 (r/w/o: 8389.02/2112.01/0.00) lat (ms,99%): 802.05 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 75 tps: 107.00 qps: 11512.99 (r/w/o: 9507.99/2005.00/0.00) lat (ms,99%): 802.05 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 75 tps: 115.00 qps: 11502.91 (r/w/o: 8890.93/2611.98/0.00) lat (ms,99%): 893.56 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 75 tps: 123.00 qps: 11880.09 (r/w/o: 9869.07/2011.01/0.00) lat (ms,99%): 773.68 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 75 tps: 103.00 qps: 11436.03 (r/w/o: 8840.03/2596.01/0.00) lat (ms,99%): 831.46 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 75 tps: 146.00 qps: 12267.97 (r/w/o: 9922.98/2345.00/0.00) lat (ms,99%): 746.32 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 75 tps: 103.00 qps: 12726.00 (r/w/o: 10069.00/2657.00/0.00) lat (ms,99%): 773.68 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 75 tps: 139.00 qps: 11811.02 (r/w/o: 9493.02/2318.00/0.00) lat (ms,99%): 746.32 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 75 tps: 95.00 qps: 10884.97 (r/w/o: 8950.97/1933.99/0.00) lat (ms,99%): 816.63 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 75 tps: 112.00 qps: 10931.97 (r/w/o: 8299.98/2631.99/0.00) lat (ms,99%): 846.57 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 75 tps: 127.00 qps: 12002.02 (r/w/o: 9967.01/2035.00/0.00) lat (ms,99%): 802.05 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            565760
        write:                           141440
        other:                           0
        total:                           707200
    transactions:                        7072   (117.35 per sec.)
    queries:                             707200 (11734.82 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.2638s
    total number of events:              7072

Latency (ms):
         min:                                  261.70
         avg:                                  638.47
         max:                                 1795.26
         99th percentile:                      877.61
         sum:                              4515261.30

Threads fairness:
    events (avg/stddev):           94.2933/1.40
    execution time (avg/stddev):   60.2035/0.06